fernan3ox/Invernadero-Psoc/Invernadero.cydsn/Generated_Source/PSoC5/ADC1.c
/*******************************************************************************
* File Name: ADC1.c
* Version 3.30
*
* Description:
*  This file provides the source code to the API for the Delta-Sigma ADC
*  Component.
*
* Note:
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "ADC1.h"

#if(ADC1_DEFAULT_INTERNAL_CLK)
    #include "ADC1_theACLK.h"
#endif /* ADC1_DEFAULT_INTERNAL_CLK */

#include "ADC1_Ext_CP_Clk.h"

#if(ADC1_DEFAULT_INPUT_MODE)
    #include "ADC1_AMux.h"
#endif /* ADC1_DEFAULT_INPUT_MODE */


/***************************************
* Global data allocation
***************************************/

/* Software flag for checking conversion completed or not */
volatile uint8 ADC1_convDone = 0u;

/* Software flag to stop conversion for single sample conversion mode
*   with resolution above 16 bits 
*/
volatile uint8 ADC1_stopConversion = 0u;

/* To run the initialization block only at the start up */
uint8 ADC1_initVar = 0u;

/* To check whether ADC started or not before switching the configuration */
volatile uint8 ADC1_started = 0u;

/* Flag to hold ADC config number. By default active config is 1. */
volatile uint8 ADC1_Config = 1u;

volatile int32 ADC1_Offset = 0;
volatile int32 ADC1_CountsPerVolt;


/***************************************
* Local data allocation
***************************************/

/* The array with precalculated gain compensation coefficients */
static ADC1_GCOR_STRUCT ADC1_gcor[ADC1_DEFAULT_NUM_CONFIGS];



/***************************************
* Forward function references
***************************************/
static void ADC1_InitConfig(uint8 config) ;
static void ADC1_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain, 
                            uint8 resolution, uint8 config) ;
static void ADC1_SetDSMRef0Reg(uint8 value) ;


/******************************************************************************
* Function Name: ADC1_Init
*******************************************************************************
*
* Summary:
*  Initialize component's parameters to the parameters set by user in the
*  customizer of the component placed onto schematic. Usually called in
* ADC1_Start().
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC1_Init(void) 
{

    ADC1_Config = 1u;
    ADC1_convDone = 0u;

    ADC1_Ext_CP_Clk_SetMode(CYCLK_DUTY);

    /* This is only valid if there is an internal clock */
    #if(ADC1_DEFAULT_INTERNAL_CLK)
        ADC1_theACLK_SetMode(CYCLK_DUTY);
    #endif /* ADC1_DEFAULT_INTERNAL_CLK */

    #if(ADC1_IRQ_REMOVE == 0u)
        /* Set interrupt priority */
        CyIntSetPriority(ADC1_INTC_NUMBER, ADC1_INTC_PRIOR_NUMBER);
    #endif   /* End ADC1_IRQ_REMOVE */

    /* Init static registers with common configuration */
    ADC1_DSM_DEM0_REG    = ADC1_CFG1_DSM_DEM0;
    ADC1_DSM_DEM1_REG    = ADC1_CFG1_DSM_DEM1;
    ADC1_DSM_MISC_REG    = ADC1_CFG1_DSM_MISC;
    ADC1_DSM_CLK_REG    |= ADC1_CFG1_DSM_CLK;
    ADC1_DSM_REF1_REG    = ADC1_CFG1_DSM_REF1;

    ADC1_DSM_OUT0_REG    = ADC1_CFG1_DSM_OUT0;
    ADC1_DSM_OUT1_REG    = ADC1_CFG1_DSM_OUT1;

    ADC1_DSM_CR0_REG     = ADC1_CFG1_DSM_CR0;
    ADC1_DSM_CR1_REG     = ADC1_CFG1_DSM_CR1;
#if(ADC1_MI_ENABLE != 0u) /* Enable Modulator Input */
    ADC1_DSM_CR3_REG     |= ADC1_DSM_MODBIT_EN;
#else
    ADC1_DSM_CR3_REG     = ADC1_CFG1_DSM_CR3;
#endif /* ADC1_MI_ENABLE != 0u*/    
    ADC1_DSM_CR8_REG     = ADC1_CFG1_DSM_CR8;
    ADC1_DSM_CR9_REG     = ADC1_CFG1_DSM_CR9;
    ADC1_DSM_CR13_REG    = ADC1_CFG1_DSM_CR13;

    ADC1_DEC_SR_REG      = ADC1_CFG1_DEC_SR;

    /* Calculate Gain compensation coefficients for all configurations */
    ADC1_GainCompensation(ADC1_CFG1_INPUT_RANGE,
                                      ADC1_CFG1_IDEAL_DEC_GAIN,
                                      ADC1_CFG1_IDEAL_ODDDEC_GAIN,
                                      ADC1_CFG1_RESOLUTION,
                                      ADC1_CFG1);
    #if(ADC1_DEFAULT_NUM_CONFIGS > 1)
        ADC1_GainCompensation(ADC1_CFG2_INPUT_RANGE,
                                          ADC1_CFG2_IDEAL_DEC_GAIN,
                                          ADC1_CFG2_IDEAL_ODDDEC_GAIN,
                                          ADC1_CFG2_RESOLUTION,
                                          ADC1_CFG2);
    #endif /* ADC1_DEFAULT_NUM_CONFIGS > 1 */
    #if(ADC1_DEFAULT_NUM_CONFIGS > 2)
        ADC1_GainCompensation(ADC1_CFG3_INPUT_RANGE,
                                          ADC1_CFG3_IDEAL_DEC_GAIN,
                                          ADC1_CFG3_IDEAL_ODDDEC_GAIN,
                                          ADC1_CFG3_RESOLUTION,
                                          ADC1_CFG3);
    #endif /* ADC1_DEFAULT_NUM_CONFIGS > 2 */
    #if(ADC1_DEFAULT_NUM_CONFIGS > 3)
        ADC1_GainCompensation(ADC1_CFG4_INPUT_RANGE,
                                          ADC1_CFG4_IDEAL_DEC_GAIN,
                                          ADC1_CFG4_IDEAL_ODDDEC_GAIN,
                                          ADC1_CFG4_RESOLUTION,
                                          ADC1_CFG4);
    #endif /* ADC1_DEFAULT_NUM_CONFIGS > 3 */

    /* Set GCOR register for config1 */
    ADC1_DEC_GVAL_REG = ADC1_gcor[ADC1_Config - 1u].gval;
    CY_SET_REG16(ADC1_DEC_GCOR_16B_PTR, ADC1_gcor[ADC1_Config - 1u].gcor);

    /* Initialize the registers with default customizer settings for config1 */
    ADC1_InitConfig(ADC1_Config);
}


/******************************************************************************
* Function Name: ADC1_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC1_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC1_Config;
    
    /* Enable active mode power for ADC */
    ADC1_PWRMGR_DEC_REG |= ADC1_ACT_PWR_DEC_EN;
    ADC1_PWRMGR_DSM_REG |= ADC1_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC1_STBY_PWRMGR_DEC_REG |= ADC1_STBY_PWR_DEC_EN;
    ADC1_STBY_PWRMGR_DSM_REG |= ADC1_STBY_PWR_DSM_EN;

