fernan3ox/Invernadero-Psoc/Invernadero.cydsn/Generated_Source/PSoC5/ADC1.c
    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC1_RESET_CR4_REG |= ADC1_IGNORE_PRESA1;
    ADC1_RESET_CR5_REG |= ADC1_IGNORE_PRESA2;

    ADC1_DSM_CR17_REG |= (ADC1_DSM_EN_BUF_VREF | ADC1_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC1_CFG1_REFERENCE == ADC1_EXT_REF_ON_P03) || \
          (ADC1_CFG1_REFERENCE == ADC1_EXT_REF_ON_P32)) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC1_CFG2_REFERENCE == ADC1_EXT_REF_ON_P03) ||  \
           (ADC1_CFG2_REFERENCE == ADC1_EXT_REF_ON_P32))) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC1_CFG3_REFERENCE == ADC1_EXT_REF_ON_P03) ||  \
           (ADC1_CFG3_REFERENCE == ADC1_EXT_REF_ON_P32))) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC1_CFG4_REFERENCE == ADC1_EXT_REF_ON_P03) || \
           (ADC1_CFG4_REFERENCE == ADC1_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC1_CFG1_REFERENCE == ADC1_EXT_REF_ON_P03) ||
             (ADC1_CFG1_REFERENCE == ADC1_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC1_CFG2_REFERENCE == ADC1_EXT_REF_ON_P03) ||
             (ADC1_CFG2_REFERENCE == ADC1_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC1_CFG3_REFERENCE == ADC1_EXT_REF_ON_P03) ||
             (ADC1_CFG3_REFERENCE == ADC1_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC1_CFG4_REFERENCE == ADC1_EXT_REF_ON_P03) ||
             (ADC1_CFG4_REFERENCE == ADC1_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC1_DSM_CR17_REG &= (uint8)~ADC1_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC1_CFG1_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC1_CFG2_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF)) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC1_CFG3_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF)) || \
         ((ADC1_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC1_CFG4_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC1_CFG1_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF) &&
            ((ADC1_CFG1_REFERENCE != ADC1_EXT_REF_ON_P03) &&
             (ADC1_CFG1_REFERENCE != ADC1_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC1_CFG2_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF) &&
             ((ADC1_CFG2_REFERENCE != ADC1_EXT_REF_ON_P03) &&
             (ADC1_CFG2_REFERENCE != ADC1_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC1_CFG3_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF) &&
             ((ADC1_CFG3_REFERENCE != ADC1_EXT_REF_ON_P03) &&
             (ADC1_CFG3_REFERENCE != ADC1_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC1_CFG4_INPUT_RANGE == ADC1_IR_VSSA_TO_2VREF) &&
             ((ADC1_CFG4_REFERENCE != ADC1_EXT_REF_ON_P03) &&
             (ADC1_CFG4_REFERENCE != ADC1_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC1_DSM_REF0_REG |= ADC1_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC1_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC1_RESET_CR4_REG &= (uint8)~ADC1_IGNORE_PRESA1;
    ADC1_RESET_CR5_REG &= (uint8)~ADC1_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC1_PUMP_CR1_REG  |= ( ADC1_PUMP_CR1_CLKSEL | ADC1_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC1_DSM_CR2_REG = ADC1_CFG1_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC1_DEFAULT_INTERNAL_CLK)
        ADC1_PWRMGR_CLK_REG |= ADC1_ACT_PWR_CLK_EN;
        ADC1_STBY_PWRMGR_CLK_REG |= ADC1_STBY_PWR_CLK_EN;
    #endif /* ADC1_DEFAULT_INTERNAL_CLK */

    /* Enable the active and alternate active power for charge pump clock */
    ADC1_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC1_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC1_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC1_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC1_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC1_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC1_INTC_NUMBER);
    #endif   /* End ADC1_IRQ_REMOVE */

    CyExitCriticalSection(enableInterrupts);

}


/*******************************************************************************
* Function Name: ADC1_Start
********************************************************************************
*
* Summary:
*  Performs all required initialization for this component and enables
*  the power. It configure all the register the first time it is called.
*  Subsequent calls of the Start function only enable the ADC and turn
*  on the power. If multiple configurations are selected, it will
*  configure the ADC for configuration 1 by default, unless the
*  ADC1_SelectConfiguration( ) function has been called to change
*  the default setting.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  ADC1_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC1_Start(void) 
{
    if(ADC1_initVar == 0u)
    {
        if(ADC1_started == 0u)
        {
            ADC1_Init();
        }
        ADC1_initVar = 1u;
    }

    /* Enable the ADC */
    ADC1_Enable();
}


/*******************************************************************************
* Function Name: ADC1_Stop
********************************************************************************
*
* Summary:
*  This function stops and powers down the ADC component and the internal
*  clock if the external clock is not selected. If an external clock is
*  used, it is up to the designer to power down the external clock it
*  required.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC1_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Stop conversions */
    ADC1_DEC_CR_REG &= (uint8)~ADC1_DEC_START_CONV;
    ADC1_DEC_SR_REG |=  ADC1_DEC_INTR_CLEAR;

    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1,
       enable PRES */
    ADC1_RESET_CR4_REG |= ADC1_IGNORE_PRESA1;
    ADC1_RESET_CR5_REG |= ADC1_IGNORE_PRESA2;

    ADC1_DSM_CR17_REG &= (uint8)~(ADC1_DSM_EN_BUF_VREF | ADC1_DSM_EN_BUF_VCM);
    ADC1_DSM_REF0_REG &= (uint8)~ADC1_DSM_EN_BUF_VREF_INN;

    /* Wait for 3 microseconds. */
    CyDelayUs(ADC1_PRES_DELAY_TIME);

