fernan3ox/Invernadero-Psoc/Invernadero.cydsn/Generated_Source/PSoC5/ADC1.c
            ADC1_Ext_CP_Clk_SetDividerRegister(ADC1_CFG4_CP_CLK_DIVIDER, 1u);

            /* This is only valid if there is an internal clock */
            #if(ADC1_DEFAULT_INTERNAL_CLK)
                ADC1_theACLK_SetDividerRegister(ADC1_CFG4_ADC_CLK_DIVIDER, 1u);
            #endif /* ADC1_DEFAULT_INTERNAL_CLK */

            #if(ADC1_IRQ_REMOVE == 0u)
                /* Set interrupt vector */
                (void)CyIntSetVector(ADC1_INTC_NUMBER, &ADC1_ISR4);
            #endif   /* End ADC1_IRQ_REMOVE */
        }
    #endif /* ADC1_DEFAULT_NUM_CONFIGS > 3 */
}


/*******************************************************************************
* Function Name: ADC1_SelectCofiguration
********************************************************************************
*
* Summary:
*  Sets one of up to four ADC configurations. Before setting the new
*  configuration, the ADC is stopped and powered down. After setting
*  the new configuration, the ADC can be powered and conversion
*  can be restarted depending up on the value of second parameter
*  restart. If the value of this parameter is 1, then ADC will be
*  restarted. If this value is zero, then user must call ADC1_Start
*  and ADC1_StartConvert() to restart the conversion.
*
* Parameters:
*  config:  configuration user wants to select.
*           Valid range: 1..4
*  restart:  Restart option. 1 means start the ADC and restart the conversion.
*                            0 means do not start the ADC and conversion.
*
* Return:
*  None
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC1_SelectConfiguration(uint8 config, uint8 restart)
                                              
{
    /* Check whether the configuration number is valid or not */
    if((config > 0u) && (config <= ADC1_DEFAULT_NUM_CONFIGS))
    {
        /* Set the flag to ensure Start() API doesn't override the 
		*  selected configuration
		*/
        if(ADC1_initVar == 0u)
        {
            ADC1_started = 1u;
        }

        /* Update the config flag */
        ADC1_Config = config;

        /* Stop the ADC  */
        ADC1_Stop();

        /* Set the  ADC registers based on the configuration */
        ADC1_InitConfig(config);

        /* Compensate the gain */
        ADC1_DEC_GVAL_REG = ADC1_gcor[config - 1u].gval;
        CY_SET_REG16(ADC1_DEC_GCOR_16B_PTR, ADC1_gcor[config - 1u].gcor);

        if(restart == 1u)
        {
            /* Restart the ADC */
            ADC1_Start();

            /* Restart the ADC conversion */
            ADC1_StartConvert();
        }
    }
    else
    {
        /* Halt CPU in debug mode if config is out of valid range */
        CYASSERT(0u != 0u);
    }
}


/*******************************************************************************
* Function Name: ADC1_GainCompensation
********************************************************************************
*
* Summary:
*  This API calculates the trim value and then store this to gcor structure.
*
* Parameters:
*  inputRange:  input range for which trim value is to be calculated.
*  IdealDecGain:  Ideal Decimator gain for the selected resolution and
*                 conversion  mode.
*  IdealOddDecGain:  Ideal odd decimation gain for the selected resolution and
                     conversion mode.
*  resolution:  Resolution to select the proper flash location for trim value.
*  config:      Specifies the configuration number
*               Valid range: 1..4
*
* Return:
*  None
*
*******************************************************************************/
static void ADC1_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain,
                              uint8 resolution, uint8 config) 
{
    int8 flash;
	int32 normalised;
	uint16 gcorValue;
    uint32 gcorTmp;

    if((config > 0u) && (config <= ADC1_DEFAULT_NUM_CONFIGS))
    {
        switch(inputRange)
        {
            case ADC1_IR_VNEG_VREF_DIFF:
            case ADC1_IR_VSSA_TO_2VREF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC1_DEC_TRIM_VREF_DIFF_16_20;
                }
                else
                {
                    flash = ADC1_DEC_TRIM_VREF_DIFF_8_15;
                }
                break;

            case ADC1_IR_VNEG_VREF_2_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC1_DEC_TRIM_VREF_2_DIFF_16_20;
                }
                else
                {
                    flash = ADC1_DEC_TRIM_VREF_2_DIFF_8_15;
                }
                break;

            case ADC1_IR_VNEG_VREF_4_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC1_DEC_TRIM_VREF_4_DIFF_16_20;
                }
                else
                {
                    flash = ADC1_DEC_TRIM_VREF_4_DIFF_8_15;
                }
                break;

            case ADC1_IR_VNEG_VREF_16_DIFF:
                /* Normalize the flash Value */
                if(resolution > 15u)
                {
                    flash = ADC1_DEC_TRIM_VREF_16_DIFF_16_20;
                }
                else
                {
                    flash = ADC1_DEC_TRIM_VREF_16_DIFF_8_15;
                }
                break;

            default:
                flash = 0;
                break;
        }

        /* Add two values */
		normalised = (int32)idealDecGain + ((int32)flash * 32);
        gcorTmp = (uint32)normalised * (uint32)idealOddDecGain;
        gcorValue = (uint16)(gcorTmp / ADC1_IDEAL_GAIN_CONST);

        if (resolution < (ADC1_MAX_GVAL - 1u))
        {
            gcorValue = (gcorValue >> (ADC1_MAX_GVAL - (resolution + 1u)));
            ADC1_gcor[config - 1u].gval = (resolution + 1u);
        }
        else
        {
            /* Use all 16 bits */
            ADC1_gcor[config - 1u].gval = ADC1_MAX_GVAL;
        }

        /* Save the gain correction register value */
        ADC1_gcor[config - 1u].gcor = gcorValue;
    }
    else
    {
        /* Halt CPU in debug mode if config is out of valid range */
        CYASSERT(0u != 0u);
    }
}


